# -*- coding: utf-8 -*-

# Часть 1: Строки, Списки, Словари
# Упражнение 1: Операции со строкой
# Дана строка: "Python Programming"
# Напишите код, который:
# 1. Выводит длину строки
# 2. Выводит символ по индексу 7
# 3. Выводит последние 3 символа
# 4. Проверяет, содержится ли в строке подстрока "gram"

my_string = "Python Programming"

# 1. Выводит длину строки
print(f"Length: {len(my_string)}")

# 2. Выводит символ по индексу 7
print(f"Seventh symbol: {my_string[7]}")

# 3. Выводит последние 3 символа
last = my_string[-3:]
print(f"Last symbols: {last}")

# 4. Проверяет, содержится ли в строке подстрока "gram"
print("gram" in my_string)


